from rich.console import Console
from rich.progress import Progress
import time

console = Console()

def show_banner():
    console.print("""
[bold cyan]
██╗     ██╗███╗   ██╗██╗  ██╗███████╗███████╗███╗   ██╗████████╗██╗   ██╗
██║     ██║████╗  ██║██║ ██╔╝██╔════╝██╔════╝████╗  ██║╚══██╔══╝╚██╗ ██╔╝
██║     ██║██╔██╗ ██║█████╔╝ ███████╗█████╗  ██╔██╗ ██║   ██║    ╚████╔╝ 
██║     ██║██║╚██╗██║██╔═██╗ ╚════██║██╔══╝  ██║╚██╗██║   ██║     ╚██╔╝  
███████╗██║██║ ╚████║██║  ██╗███████║███████╗██║ ╚████║   ██║      ██║   
╚══════╝╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝╚══════╝╚═╝  ╚═══╝   ╚═╝      ╚═╝   

        LinkSentry v1.1 - Broken URL Intelligence Tool
[/bold cyan]
""")

def run_progress(total):
    with Progress() as progress:
        task = progress.add_task("[green]Scanning...", total=total)
        for _ in range(total):
            time.sleep(0.01)
            progress.update(task, advance=1)
